const timetableData = {
    1: { 
        name: "ПОНЕДІЛОК", 
        lessons: [
            { num: 1, name: "Макроекономіка", teacher: "Мінічев О.В.", room: "к.14 а. 6", type: "Практика" },
            { num: 2, name: "Фінанси", teacher: "Герасим К.С.", room: "к.14 а. 61", type: "Практика" },
            { num: 3, name: "Економ-мат методи та моделі", teacher: "Григорків М.В.", room: "к.14 а. 64,67", type: "Лабораторна" },
            { num: 4, name: "ОНС, ДВ", teacher: "", room: "", type: "Вибіркова" },
            
            // П'ЯТА ПАРА: Є тільки на 1-му тижні
            { num: 5, 
              week1: { name: "ОНС", teacher: "", room: "", type: "Вибіркова" }, 
              week2: { name: "НЕМА" } 
            }
        ]
    },
    2: { 
        name: "ВІВТОРОК", 
        lessons: [
            { num: 1, name: "Економ-мат методи та моделі", teacher: "Григорків В.С.", room: "к.14 а. 60", type: "Лекція" },
            { num: 4, name: "Банківська система", teacher: "Марич М.Г.", room: "к.2 а. 216", type: "Лекція" },
            { num: 5, name: "Фінанси", teacher: "Марусяк Н.Л.", room: "к.2 а. 216", type: "Лекція" }
        ]
    },
    3: { 
        name: "СЕРЕДА", 
        lessons: [
            { num: 1, name: "Менеджмент", teacher: "Гушилик А.Б.", room: "к.19 а. 207", type: "Практика" },
            { num: 4, name: "Загальноуніверситетські вибіркові дисципліни", teacher: "", room: "Онлайн", type: "Вибіркова" },
            
            // П'ЯТА ПАРА: Є тільки на 2-му тижні
            { num: 5, 
              week1: { name: "НЕМА" }, 
              week2: { name: "ДВВ", teacher: "", room: "Онлайн", type: "Практика" } 
            },

            // ШОСТА ПАРА: Лекція на 1-му тижні, Практика на 2-му
            { num: 6, 
              week1: { name: "ДВВ", teacher: "", room: "Онлайн", type: "Лекція" }, 
              week2: { name: "ДВВ", teacher: "", room: "Онлайн", type: "Практика" } 
            }
        ]
    },
    4: { 
        name: "ЧЕТВЕРГ", 
        lessons: [
            { num: 3, name: "Банківська система", teacher: "Федишин М.П.", room: "к.19 а. 301", type: "Практика" },
            { num: 4, name: "Іноземна мова за ПС", teacher: "Рубанець Т.В.", room: "к.19 а. 201", type: "Практика" }
        ]
    },
    5: { 
        name: "П'ЯТНИЦЯ", 
        lessons: [
            { num: 3, name: "Менеджмент", teacher: "Клевчік Л.Л.", room: "к.1 а. 39", type: "Лекція" },
            { num: 4, name: "Макроекономіка", teacher: "Сторощук Б.Д.", room: "к.14 а. 39", type: "Лекція" }
        ]
    }
};
