const timetableData = {
    1: { name: "ПОНЕДІЛОК", lessons: [
        { num: 2, name: "Гроші і кредит", teacher: "Ткач Є.В.", room: "к.19 а 101", type: "Лекція" },
        { num: 3, name: "Мікроекономіка", teacher: "Бойда С.В.", room: "к.19 а 101", type: "Лекція" },
        { num: 4, name: "Правознавство", teacher: "Струтинська-Струк Л.В.", room: "к.19 а 101", type: "Лекція" }
    ]},
    2: { name: "ВІВТОРОК", lessons: [
        { num: 2, name: "Статистика", teacher: "Вінничук О.Ю.", room: "к.14 а. 73", type: "Лекція" },
        { num: 3, 
          week1: { name: "НЕМА" }, 
          week2: { name: "Правознавство ", teacher: "Паламарчук А.", room: "к. 14 а 69", type: "Семінар" } 
        },
        { num: 4, name: "Іноземна мова за ПС", teacher: "Рубанець Т.В.", room: "к.19 а 207", type: "Семінар" }
    ]},
    3: { name: "СЕРЕДА", lessons: [
        { num: 1, name: "Філософія", teacher: "Бродецький О. Є.", room: "к.19 а 101", type: "Лекція" },
        // ВТОРАЯ ПАРА ВД
        { num: 2, 
          name: "Вибіркові дисципліни", 
          isVD: true,
          type: "Лекція",
          choices: [
            { title: "ОНД", teacher: "Корбутяк А.Г.", room: "к.19 а. 201" },
            { title: "Крит. мислення", teacher: "Белей С.І.", room: "к.19 а. 202" }
          ]
        },
        // ТРЕТЬЯ ПАРА ВД
        { num: 3, 
          name: "Вибіркові дисципліни", 
          isVD: true,
          type: "Практика",
          choices: [
              { title: "ОНД", teacher: "Корбутяк А.Г.", room: "к.19 а. 201" },
            { title: "Крит. мислення", teacher: "Мудряк Д.Л.", room: "к.19 а. 307" }
          ]
        },
        { num: 4, name: "Фізичне виховання", teacher: "", room: "Кафедра фіз. виховання", type: "Спорт" }
    ]},
    4: { name: "ЧЕТВЕРГ", lessons: [
        { num: 2, name: "Гроші і кредит", teacher: "Олексин А.Г.", room: "к.19 а 203", type: "Практика" },
        { num: 3, name: "Філософія", teacher: "Бродецький О. Є.", room: "к.19 а. 102А", type: "Семінар" },
        { num: 4, 
          week1: { name: "НЕМА" }, 
          week2: { name: "Гроші і кредит", teacher: "Олексин А.Г.", room: "к.19 а 203", type: "Практика" } 
        }
    ]},
    5: { name: "П'ЯТНИЦЯ", lessons: [
        { num: 2, name: "Статистика", teacher: "Вінничук О.Ю.", room: "к.14 а 64,67", type: "Лабораторна" },
        { num: 3, name: "Мікроекономіка", teacher: "Жук Н.О.", room: "к.19 а 201", type: "Практика" },
        { num: 4, name: "НЕМА" }
    ]}
};
